{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "5e3cb542-933d-4bf3-a82b-d9d6395a7832",
   "metadata": {
    "tags": []
   },
   "source": [
    "# Wikibase Agent\n",
    "\n",
    "This notebook demonstrates a very simple wikibase agent that uses sparql generation. Although this code is intended to work against any\n",
    "wikibase instance, we use http://wikidata.org for testing.\n",
    "\n",
    "If you are interested in wikibases and sparql, please consider helping to improve this agent. Look [here](https://github.com/donaldziff/langchain-wikibase) for more details and open questions.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "07d42966-7e99-4157-90dc-6704977dcf1b",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Preliminaries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9132f093-c61e-4b8d-abef-91ebef3fc85f",
   "metadata": {
    "tags": []
   },
   "source": [
    "### API keys and other secrats\n",
    "\n",
    "We use an `.ini` file, like this: \n",
    "```\n",
    "[OPENAI]\n",
    "OPENAI_API_KEY=xyzzy\n",
    "[WIKIDATA]\n",
    "WIKIDATA_USER_AGENT_HEADER=argle-bargle\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "99567dfd-05a7-412f-abf0-9b9f4424acbd",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['./secrets.ini']"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import configparser\n",
    "config = configparser.ConfigParser()\n",
    "config.read('./secrets.ini')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "332b6658-c978-41ca-a2be-4f8677fecaef",
   "metadata": {
    "tags": []
   },
   "source": [
    "### OpenAI API Key\n",
    "\n",
    "An OpenAI API key is required unless you modify the code below to use another LLM provider."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "dd328ee2-33cc-4e1e-aff7-cc0a2e05e2e6",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "openai_api_key = config['OPENAI']['OPENAI_API_KEY']\n",
    "import os\n",
    "os.environ.update({'OPENAI_API_KEY': openai_api_key})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "42a9311b-600d-42bc-b000-2692ef87a213",
   "metadata": {
    "tags": []
   },
   "source": [
    "### Wikidata user-agent header\n",
    "\n",
    "Wikidata policy requires a user-agent header. See https://meta.wikimedia.org/wiki/User-Agent_policy. However, at present this policy is not strictly enforced."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "17ba657e-789d-40e1-b4b7-4f29ba06fe79",
   "metadata": {},
   "outputs": [],
   "source": [
    "wikidata_user_agent_header = None if not config.has_section('WIKIDATA') else config['WIKIDATA']['WIKIDAtA_USER_AGENT_HEADER']"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "db08d308-050a-4fc8-93c9-8de4ae977ac3",
   "metadata": {},
   "source": [
    "### Enable tracing if desired"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "77d2da08-fccd-4676-b77e-c0e89bf343cb",
   "metadata": {},
   "outputs": [],
   "source": [
    "#import os\n",
    "#os.environ[\"LANGCHAIN_HANDLER\"] = \"langchain\"\n",
    "#os.environ[\"LANGCHAIN_SESSION\"] = \"default\" # Make sure this session actually exists. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3dbc5bfc-48ce-4f90-873c-7336b21300c6",
   "metadata": {},
   "source": [
    "# Tools\n",
    "\n",
    "Three tools are provided for this simple agent:\n",
    "* `ItemLookup`: for finding the q-number of an item\n",
    "* `PropertyLookup`: for finding the p-number of a property\n",
    "* `SparqlQueryRunner`: for running a sparql query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1f801b4e-6576-4914-aa4f-6f4c4e3c7924",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Item and Property lookup\n",
    "\n",
    "Item and Property lookup are implemented in a single method, using an elastic search endpoint. Not all wikibase instances have it, but wikidata does, and that's where we'll start."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "42d23f0a-1c74-4c9c-85f2-d0e24204e96a",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_nested_value(o: dict, path: list) -> any:\n",
    "    current = o\n",
    "    for key in path:\n",
    "        try:\n",
    "            current = current[key]\n",
    "        except:\n",
    "            return None\n",
    "    return current\n",
    "\n",
    "import requests\n",
    "\n",
    "from typing import Optional\n",
    "\n",
    "def vocab_lookup(search: str, entity_type: str = \"item\",\n",
    "                 url: str = \"https://www.wikidata.org/w/api.php\",\n",
    "                 user_agent_header: str = wikidata_user_agent_header,\n",
    "                 srqiprofile: str = None,\n",
    "                ) -> Optional[str]:    \n",
    "    headers = {\n",
    "        'Accept': 'application/json'\n",
    "    }\n",
    "    if wikidata_user_agent_header is not None:\n",
    "        headers['User-Agent'] = wikidata_user_agent_header\n",
    "    \n",
    "    if entity_type == \"item\":\n",
    "        srnamespace = 0\n",
    "        srqiprofile = \"classic_noboostlinks\" if srqiprofile is None else srqiprofile\n",
    "    elif entity_type == \"property\":\n",
    "        srnamespace = 120\n",
    "        srqiprofile = \"classic\" if srqiprofile is None else srqiprofile\n",
    "    else:\n",
    "        raise ValueError(\"entity_type must be either 'property' or 'item'\")          \n",
    "    \n",
    "    params = {\n",
    "        \"action\": \"query\",\n",
    "        \"list\": \"search\",\n",
    "        \"srsearch\": search,\n",
    "        \"srnamespace\": srnamespace,\n",
    "        \"srlimit\": 1,\n",
    "        \"srqiprofile\": srqiprofile,\n",
    "        \"srwhat\": 'text',\n",
    "        \"format\": \"json\"\n",
    "    }\n",
    "    \n",
    "    response = requests.get(url, headers=headers, params=params)\n",
    "        \n",
    "    if response.status_code == 200:\n",
    "        title = get_nested_value(response.json(), ['query', 'search', 0, 'title'])\n",
    "        if title is None:\n",
    "            return f\"I couldn't find any {entity_type} for '{search}'. Please rephrase your request and try again\"\n",
    "        # if there is a prefix, strip it off\n",
    "        return title.split(':')[-1]\n",
    "    else:\n",
    "        return \"Sorry, I got an error. Please try again.\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "e52060fa-3614-43fb-894e-54e9b75d1e9f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q4180017\n"
     ]
    }
   ],
   "source": [
    "print(vocab_lookup(\"Malin 1\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "b23ab322-b2cf-404e-b36f-2bfc1d79b0d3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "P31\n"
     ]
    }
   ],
   "source": [
    "print(vocab_lookup(\"instance of\", entity_type=\"property\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "89020cc8-104e-42d0-ac32-885e590de515",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "I couldn't find any item for 'Ceci n'est pas un q-item'. Please rephrase your request and try again\n"
     ]
    }
   ],
   "source": [
    "print(vocab_lookup(\"Ceci n'est pas un q-item\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78d66d8b-0e34-4d3f-a18d-c7284840ac76",
   "metadata": {},
   "source": [
    "## Sparql runner "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c6f60069-fbe0-4015-87fb-0e487cd914e7",
   "metadata": {},
   "source": [
    "This tool runs sparql - by default, wikidata is used."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "b5b97a4d-2a39-4993-88d9-e7818c0a2853",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "from typing import List, Dict, Any\n",
    "import json\n",
    "\n",
    "def run_sparql(query: str, url='https://query.wikidata.org/sparql',\n",
    "               user_agent_header: str = wikidata_user_agent_header) -> List[Dict[str, Any]]:\n",
    "    headers = {\n",
    "        'Accept': 'application/json'\n",
    "    }\n",
    "    if wikidata_user_agent_header is not None:\n",
    "        headers['User-Agent'] = wikidata_user_agent_header\n",
    "\n",
    "    response = requests.get(url, headers=headers, params={'query': query, 'format': 'json'})\n",
    "\n",
    "    if response.status_code != 200:\n",
    "        return \"That query failed. Perhaps you could try a different one?\"\n",
    "    results = get_nested_value(response.json(),['results', 'bindings'])\n",
    "    return json.dumps(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "149722ec-8bc1-4d4f-892b-e4ddbe8444c1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'[{\"count\": {\"datatype\": \"http://www.w3.org/2001/XMLSchema#integer\", \"type\": \"literal\", \"value\": \"20\"}}]'"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_sparql(\"SELECT (COUNT(?children) as ?count) WHERE { wd:Q1339 wdt:P40 ?children . }\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9f0302fd-ba35-4acc-ba32-1d7c9295c898",
   "metadata": {},
   "source": [
    "# Agent"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3122a961-9673-4a52-b1cd-7d62fbdf8d96",
   "metadata": {},
   "source": [
    "## Wrap the tools"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "cc41ae88-2e53-4363-9878-28b26430cb1e",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.agents import Tool, AgentExecutor, LLMSingleActionAgent, AgentOutputParser\n",
    "from langchain.prompts import StringPromptTemplate\n",
    "from langchain import OpenAI, LLMChain\n",
    "from typing import List, Union\n",
    "from langchain.schema import AgentAction, AgentFinish\n",
    "import re"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "2810a3ce-b9c6-47ee-8068-12ca967cd0ea",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define which tools the agent can use to answer user queries\n",
    "tools = [\n",
    "    Tool(\n",
    "        name = \"ItemLookup\",\n",
    "        func=(lambda x: vocab_lookup(x, entity_type=\"item\")),\n",
    "        description=\"useful for when you need to know the q-number for an item\"\n",
    "    ),\n",
    "    Tool(\n",
    "        name = \"PropertyLookup\",\n",
    "        func=(lambda x: vocab_lookup(x, entity_type=\"property\")),\n",
    "        description=\"useful for when you need to know the p-number for a property\"\n",
    "    ),\n",
    "    Tool(\n",
    "        name = \"SparqlQueryRunner\",\n",
    "        func=run_sparql,\n",
    "        description=\"useful for getting results from a wikibase\"\n",
    "    )    \n",
    "]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ab0f2778-a195-4a4a-a5b4-c1e809e1fb7b",
   "metadata": {},
   "source": [
    "## Prompts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "7bd4ba4f-57d6-4ceb-b932-3cb0d0509a24",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Set up the base template\n",
    "template = \"\"\"\n",
    "Answer the following questions by generating a sparql query against a wikibase where the p and q items are \n",
    "completely unknown to you. You will need to discover the p and q items before you can generate the sparql.\n",
    "Do not assume you know the p and q items for any concepts. Always use tools to find all p and q items.\n",
    "\n",
    "When generating sparql:\n",
    "* Try to avoid \"count\" and \"filter\" queries if possible\n",
    "* Never enclose the sparql in back-quotes\n",
    "* If you think the query might produce one or more q items, always ask for their labels also\n",
    "\n",
    "If the user's question begins with the words \"Please generate sparql to answer the question\"  \n",
    "then return your sparql as a final answer. \n",
    "\n",
    "Otherwise, after you generate the sparql, you should run it. The results will be returned in json. You should then\n",
    "summarize the json results in natural language. Do not include any facts that are not in the json response.\n",
    "If the json is empty, generate a summary based on that.\n",
    "\n",
    "You may assume the following prefixes:\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "PREFIX p: <http://www.wikidata.org/prop/>\n",
    "PREFIX ps: <http://www.wikidata.org/prop/statement/>\n",
    "\n",
    "You have access to the following tools:\n",
    "\n",
    "{tools}\n",
    "\n",
    "Use the following format:\n",
    "\n",
    "Question: the input question for which you must provide either a natural language answer or a sparql query\n",
    "Thought: you should always think about what to do\n",
    "Action: the action to take, should be one of [{tool_names}]\n",
    "Action Input: the input to the action\n",
    "Observation: the result of the action\n",
    "... (this Thought/Action/Action Input/Observation can repeat N times)\n",
    "Thought: I now know the final answer\n",
    "Final Answer: the final answer to the original input question\n",
    "\n",
    "Question: {input}\n",
    "{agent_scratchpad}\"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "7e8d771a-64bb-4ec8-b472-6a9a40c6dd38",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Set up a prompt template\n",
    "class CustomPromptTemplate(StringPromptTemplate):\n",
    "    # The template to use\n",
    "    template: str\n",
    "    # The list of tools available\n",
    "    tools: List[Tool]\n",
    "    \n",
    "    def format(self, **kwargs) -> str:\n",
    "        # Get the intermediate steps (AgentAction, Observation tuples)\n",
    "        # Format them in a particular way\n",
    "        intermediate_steps = kwargs.pop(\"intermediate_steps\")\n",
    "        thoughts = \"\"\n",
    "        for action, observation in intermediate_steps:\n",
    "            thoughts += action.log\n",
    "            thoughts += f\"\\nObservation: {observation}\\nThought: \"\n",
    "        # Set the agent_scratchpad variable to that value\n",
    "        kwargs[\"agent_scratchpad\"] = thoughts\n",
    "        # Create a tools variable from the list of tools provided\n",
    "        kwargs[\"tools\"] = \"\\n\".join([f\"{tool.name}: {tool.description}\" for tool in self.tools])\n",
    "        # Create a list of tool names for the tools provided\n",
    "        kwargs[\"tool_names\"] = \", \".join([tool.name for tool in self.tools])\n",
    "        return self.template.format(**kwargs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "f97dca78-fdde-4a70-9137-e34a21d14e64",
   "metadata": {},
   "outputs": [],
   "source": [
    "prompt = CustomPromptTemplate(\n",
    "    template=template,\n",
    "    tools=tools,\n",
    "    # This omits the `agent_scratchpad`, `tools`, and `tool_names` variables because those are generated dynamically\n",
    "    # This includes the `intermediate_steps` variable because that is needed\n",
    "    input_variables=[\"input\", \"intermediate_steps\"]\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "12c57d77-3c1e-4cde-9a83-7d2134392479",
   "metadata": {},
   "source": [
    "## Output parser \n",
    "This is unchanged from langchain docs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "42da05eb-c103-4649-9d20-7143a8880721",
   "metadata": {},
   "outputs": [],
   "source": [
    "class CustomOutputParser(AgentOutputParser):\n",
    "    \n",
    "    def parse(self, llm_output: str) -> Union[AgentAction, AgentFinish]:\n",
    "        # Check if agent should finish\n",
    "        if \"Final Answer:\" in llm_output:\n",
    "            return AgentFinish(\n",
    "                # Return values is generally always a dictionary with a single `output` key\n",
    "                # It is not recommended to try anything else at the moment :)\n",
    "                return_values={\"output\": llm_output.split(\"Final Answer:\")[-1].strip()},\n",
    "                log=llm_output,\n",
    "            )\n",
    "        # Parse out the action and action input\n",
    "        regex = r\"Action: (.*?)[\\n]*Action Input:[\\s]*(.*)\"\n",
    "        match = re.search(regex, llm_output, re.DOTALL)\n",
    "        if not match:\n",
    "            raise ValueError(f\"Could not parse LLM output: `{llm_output}`\")\n",
    "        action = match.group(1).strip()\n",
    "        action_input = match.group(2)\n",
    "        # Return the action and action input\n",
    "        return AgentAction(tool=action, tool_input=action_input.strip(\" \").strip('\"'), log=llm_output)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "d2b4d710-8cc9-4040-9269-59cf6c5c22be",
   "metadata": {},
   "outputs": [],
   "source": [
    "output_parser = CustomOutputParser()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "48a758cb-93a7-4555-b69a-896d2d43c6f0",
   "metadata": {},
   "source": [
    "## Specify the LLM model"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "72988c79-8f60-4b0f-85ee-6af32e8de9c2",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chat_models import ChatOpenAI\n",
    "llm = ChatOpenAI(model=\"gpt-4\", temperature=0)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "95685d14-647a-4e24-ae2c-a8dd1e364921",
   "metadata": {},
   "source": [
    "## Agent and agent executor"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "13d55765-bfa1-43b3-b7cb-00f52ebe7747",
   "metadata": {},
   "outputs": [],
   "source": [
    "# LLM chain consisting of the LLM and a prompt\n",
    "llm_chain = LLMChain(llm=llm, prompt=prompt)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "b3f7ac3c-398e-49f9-baed-554f49a191c3",
   "metadata": {},
   "outputs": [],
   "source": [
    "tool_names = [tool.name for tool in tools]\n",
    "agent = LLMSingleActionAgent(\n",
    "    llm_chain=llm_chain, \n",
    "    output_parser=output_parser,\n",
    "    stop=[\"\\nObservation:\"], \n",
    "    allowed_tools=tool_names\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "65740577-272e-4853-8d47-b87784cfaba0",
   "metadata": {},
   "outputs": [],
   "source": [
    "agent_executor = AgentExecutor.from_agent_and_tools(agent=agent, tools=tools, verbose=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "66e3d13b-77cf-41d3-b541-b54535c14459",
   "metadata": {},
   "source": [
    "## Run it!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "6e97a07c-d7bf-4a35-9ab2-b59ae865c62c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# If you prefer in-line tracing, uncomment this line\n",
    "# agent_executor.agent.llm_chain.verbose = True"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "a11ca60d-f57b-4fe8-943e-a258e37463c7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: In order to find the number of children J.S. Bach had, I need to know the q-number for J.S. Bach and the p-number for the \"has children\" property.\n",
      "Action: ItemLookup\n",
      "Action Input: J.S. Bach\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ1339\u001b[0m\u001b[32;1m\u001b[1;3mNow, I have the q-number for J.S. Bach (Q1339). Next, I need to find the p-number for the \"has children\" property.\n",
      "Action: PropertyLookup\n",
      "Action Input: has children\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP40\u001b[0m\u001b[32;1m\u001b[1;3mNow, I have the p-number for \"has children\" (P40). I can now create a sparql query to find the number of J.S. Bach's children.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT (COUNT(?children) AS ?childrenCount) WHERE {\n",
      "  wd:Q1339 wdt:P40 ?children.\n",
      "}\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"childrenCount\": {\"datatype\": \"http://www.w3.org/2001/XMLSchema#integer\", \"type\": \"literal\", \"value\": \"20\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer\n",
      "Final Answer: J.S. Bach had 20 children.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'J.S. Bach had 20 children.'"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"How many children did J.S. Bach have?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "15937dd2-48d6-4467-9905-e1131be4fa39",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the q-number for J.S. Bach.\n",
      "Action: ItemLookup\n",
      "Action Input: J.S. Bach\n",
      "\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ1339\u001b[0m\u001b[32;1m\u001b[1;3mI now know the q-number for J.S. Bach. I need to find the p-number for the \"number of children\" property.\n",
      "Action: PropertyLookup\n",
      "Action Input: number of children\n",
      "\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP1971\u001b[0m\u001b[32;1m\u001b[1;3mI now know the p-number for the \"number of children\" property. I can generate the sparql query to get the number of children of J.S. Bach.\n",
      "Final Answer: SELECT ?children WHERE { wd:Q1339 wdt:P1971 ?children }\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'SELECT ?children WHERE { wd:Q1339 wdt:P1971 ?children }'"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"Please generate sparql to answer the question: How many children did J.S. Bach have?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "d0b42a41-996b-4156-82e4-f0651a87ee34",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the q-number for Hakeem Olajuwon\n",
      "Action: ItemLookup\n",
      "Action Input: Hakeem Olajuwon\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ273256\u001b[0m\u001b[32;1m\u001b[1;3mI need to find the p-number for the Basketball-Reference.com NBA player ID property\n",
      "Action: PropertyLookup\n",
      "Action Input: Basketball-Reference.com NBA player ID\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP2685\u001b[0m\u001b[32;1m\u001b[1;3mI now have the q-number for Hakeem Olajuwon and the p-number for the Basketball-Reference.com NBA player ID property, so I can create a SPARQL query to find the ID\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: SELECT ?id ?idLabel WHERE { wd:Q273256 wdt:P2685 ?id .  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } }\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"id\": {\"type\": \"literal\", \"value\": \"o/olajuha01\"}, \"idLabel\": {\"type\": \"literal\", \"value\": \"o/olajuha01\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer\n",
      "Final Answer: The Basketball-Reference.com NBA player ID of Hakeem Olajuwon is \"o/olajuha01\".\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The Basketball-Reference.com NBA player ID of Hakeem Olajuwon is \"o/olajuha01\".'"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"What is the Basketball-Reference.com NBA player ID of Hakeem Olajuwon?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "526a38cb-9ec0-4ea4-9d4c-8ac2ab485bdd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the Q number for Hakeem Olajuwon\n",
      "Action: ItemLookup\n",
      "Action Input: Hakeem Olajuwon\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ273256\u001b[0m\u001b[32;1m\u001b[1;3mNow I need to find the P number for Basketball-Reference.com NBA player ID\n",
      "Action: PropertyLookup\n",
      "Action Input: Basketball-Reference.com NBA player ID\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP2685\u001b[0m\u001b[32;1m\u001b[1;3mNow I can create a sparql query to get the Basketball-Reference.com NBA player ID of Hakeem Olajuwon\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
      "SELECT ?playerID ?playerIDLabel WHERE {\n",
      "  wd:Q273256 wdt:P2685 ?playerID .\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
      "}\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"playerID\": {\"type\": \"literal\", \"value\": \"o/olajuha01\"}, \"playerIDLabel\": {\"type\": \"literal\", \"value\": \"o/olajuha01\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer\n",
      "Final Answer: The Basketball-Reference.com NBA player ID of Hakeem Olajuwon is \"o/olajuha01\".\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The Basketball-Reference.com NBA player ID of Hakeem Olajuwon is \"o/olajuha01\".'"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"Please generate sparql to answer the question: What is the Basketball-Reference.com NBA player ID of Hakeem Olajuwon?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "05fb3a3e-8a9f-482d-bd54-4c6e60ef60dd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the Q-item for Malin 1\n",
      "Action: ItemLookup\n",
      "Action Input: Malin 1\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ4180017\u001b[0m\u001b[32;1m\u001b[1;3mNow I need to find the property for 'right ascension'\n",
      "Action: PropertyLookup\n",
      "Action Input: right ascension\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP6257\u001b[0m\u001b[32;1m\u001b[1;3mI have the Q-item for Malin 1 and the property for 'right ascension', now I can query the right ascension of Malin 1.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: SELECT ?ra WHERE { wd:Q4180017 wdt:P6257 ?ra }\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"ra\": {\"datatype\": \"http://www.w3.org/2001/XMLSchema#decimal\", \"type\": \"literal\", \"value\": \"189.2472790557151\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer\n",
      "Final Answer: The right ascension of Malin 1 is 189.2472790557151 degrees.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The right ascension of Malin 1 is 189.2472790557151 degrees.'"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"What is the right ascension of Malin 1?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "c2b78c5c-9b60-422d-a84e-ea99953e7052",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the Q item for Malin 1.\n",
      "Action: ItemLookup\n",
      "Action Input: Malin 1\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ4180017\u001b[0m\u001b[32;1m\u001b[1;3mI found the Q item for Malin 1. Now I need to find the P item for right ascension.\n",
      "Action: PropertyLookup\n",
      "Action Input: right ascension\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP6257\u001b[0m\u001b[32;1m\u001b[1;3mI found the P item for right ascension. Now I can create a SPARQL query to find the right ascension of Malin 1.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?ra WHERE {\n",
      "  wd:Q4180017 wdt:P6257 ?ra.\n",
      "}\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"ra\": {\"datatype\": \"http://www.w3.org/2001/XMLSchema#decimal\", \"type\": \"literal\", \"value\": \"189.2472790557151\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI found the right ascension of Malin 1 is 189.2472790557151 degrees which is greater than 145 degrees.\n",
      "Final Answer: Yes, the right ascension of Malin 1 is greater than 145 degrees.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Yes, the right ascension of Malin 1 is greater than 145 degrees.'"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"Is the right ascension of Malin 1 greater than 145 degrees?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "fb2cc59b-9e21-4eb1-aa2e-4283c6d4341a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the Q-item for Delta Air Lines.\n",
      "Action: ItemLookup\n",
      "Action Input: Delta Air Lines\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ188920\u001b[0m\u001b[32;1m\u001b[1;3mI found the Q-item for Delta Air Lines. Now I need to find the P-item for in-house publication.\n",
      "Action: PropertyLookup\n",
      "Action Input: in-house publication\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP2813\u001b[0m\u001b[32;1m\u001b[1;3mI found the P-item for in-house publication. Now I can write the SPARQL query to find the in-house publication of Delta Air Lines.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX ps: <http://www.wikidata.org/prop/statement/> SELECT ?publication ?publicationLabel WHERE { wd:Q188920 wdt:P2813 ?publication . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . ?publication rdfs:label ?publicationLabel . } }\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"publication\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q3486420\"}, \"publicationLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Sky\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer.\n",
      "Final Answer: Delta Air Line's in-house publication is called \"Sky.\"\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Delta Air Line\\'s in-house publication is called \"Sky.\"'"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"What is Delta Air Line's in-house publication?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "1e69301b-2285-41a0-b439-d23714b92a88",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the q-number for \"Fielders Stadium.\"\n",
      "Action: ItemLookup\n",
      "Action Input: Fielders Stadium\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ5447154\u001b[0m\u001b[32;1m\u001b[1;3mI found the q-number for Fielders Stadium. Now, I need to find the q-number for \"Kevin Costner.\"\n",
      "Action: ItemLookup\n",
      "Action Input: Kevin Costner\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ11930\u001b[0m\u001b[32;1m\u001b[1;3mI found the q-number for Kevin Costner. Now, I need to find the p-number for the \"owned by\" property.\n",
      "Action: PropertyLookup\n",
      "Action Input: owned by\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP127\u001b[0m\u001b[32;1m\u001b[1;3mI found the p-number for the \"owned by\" property. Now, I can run a SPARQL query to check if Fielders Stadium is owned by Kevin Costner.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?ownership WHERE {\n",
      "  wd:Q5447154 wdt:P127 ?ownership .\n",
      "}\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"ownership\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q11930\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer.\n",
      "Final Answer: Yes, Fielders Stadium is owned by Kevin Costner.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Yes, Fielders Stadium is owned by Kevin Costner.'"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"Is Fielders Stadium owned by Kevin Costner?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "6ecd07e5-6b8f-4c62-a0b1-b378833bbaf7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the q-item for \"Fielders Stadium\"\n",
      "Action: ItemLookup\n",
      "Action Input: Fielders Stadium\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ5447154\u001b[0m\u001b[32;1m\u001b[1;3mNow I know the q item for Fielders Stadium, I need to find the p-item for \"owner.\"\n",
      "Action: PropertyLookup\n",
      "Action Input: owner\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP127\u001b[0m\u001b[32;1m\u001b[1;3mNow I know the p-item for \"owner,\" I can construct and run a SPARQL query to find the owner of Fielders Stadium.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?owner ?ownerLabel WHERE {\n",
      "  wd:Q5447154 wdt:P127 ?owner .\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
      "}\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"owner\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q11930\"}, \"ownerLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Kevin Costner\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer.\n",
      "Final Answer: The owner of Fielders Stadium is Kevin Costner.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The owner of Fielders Stadium is Kevin Costner.'"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"Who or what is the owner of Fielders Stadium?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "31b752cd-bc76-4d75-be01-4bcf32eda98f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the q-number for Ranavalona I\n",
      "Action: ItemLookup\n",
      "Action Input: Ranavalona I\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ169794\u001b[0m\u001b[32;1m\u001b[1;3mI need to find the p-number for \"husband\"\n",
      "Action: PropertyLookup\n",
      "Action Input: husband\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP26\u001b[0m\u001b[32;1m\u001b[1;3mI need to find the q-number for \"child\"\n",
      "Action: PropertyLookup\n",
      "Action Input: child\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP40\u001b[0m\u001b[32;1m\u001b[1;3mI will write a sparql query to find the child of Ranavalona I's husband\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?child ?childLabel WHERE {\n",
      "  wd:Q169794 wdt:P26 ?husband .\n",
      "  ?husband wdt:P40 ?child .\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
      "}\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"child\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q528996\"}, \"childLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Rainilaiarivony\"}}, {\"child\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q1396490\"}, \"childLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Rainivoninahitriniony\"}}, {\"child\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q67165290\"}, \"childLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Princess Raketaka of Madagascar\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer\n",
      "Final Answer: The children of Ranavalona I's husband are Rainilaiarivony, Rainivoninahitriniony, and Princess Raketaka of Madagascar.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"The children of Ranavalona I's husband are Rainilaiarivony, Rainivoninahitriniony, and Princess Raketaka of Madagascar.\""
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"Who is the child of Ranavalona I's husband?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "86500b46-9c11-46e1-827b-0ebd285cf472",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the winner of the 1885 Wimbledon Championships- Gentlemen's Singles\n",
      "Action: ItemLookup\n",
      "Action Input: 1885 Wimbledon Championships – Gentlemen's Singles\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ1356316\u001b[0m\u001b[32;1m\u001b[1;3mI now have the q-number for the 1885 Wimbledon Championships- Gentlemen's Singles event. I need to find the property for \"winner\".\n",
      "Action: PropertyLookup\n",
      "Action Input: winner\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP1346\u001b[0m\u001b[32;1m\u001b[1;3mI now have the p-number for the winner property. I will construct a sparql query to find the winner of the Q1356316 event.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?winner ?winnerLabel WHERE {\n",
      "  wd:Q1356316 wdt:P1346 ?winner .\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
      "}\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"winner\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q365139\"}, \"winnerLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"William Renshaw\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer.\n",
      "Final Answer: William Renshaw won the 1885 Wimbledon Championships- Gentlemen's Singles.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"William Renshaw won the 1885 Wimbledon Championships- Gentlemen's Singles.\""
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"Who won the 1885 Wimbledon Championships- Gentlemen's Singles?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "de101809-d6d1-461a-ac64-78fd72c4e9e0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the q-number for the 1974 Mariposa Folk Festival\n",
      "Action: ItemLookup\n",
      "Action Input: 1974 Mariposa Folk Festival\n",
      "\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ54554872\u001b[0m\u001b[32;1m\u001b[1;3mI need to find the p-number for the \"participant\" property\n",
      "Action: PropertyLookup\n",
      "Action Input: participant\n",
      "\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP710\u001b[0m\u001b[32;1m\u001b[1;3mI can now create a SPARQL query to find the participants of the 1974 Mariposa Folk Festival\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?participant ?participantLabel WHERE {\n",
      "  wd:Q54554872 wdt:P710 ?participant.\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
      "}\n",
      "\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q268478\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Malvina Reynolds\"}}, {\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q549141\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"John Hammond\"}}, {\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q585159\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Steve Goodman\"}}, {\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q615962\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Bill Reid\"}}, {\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q637195\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Alanis Obomsawin\"}}, {\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q2581437\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Willie Dunn\"}}, {\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q3106360\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Gilles Losier\"}}, {\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q3808659\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Joe Hickerson\"}}, {\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q7343412\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Robert Davidson\"}}, {\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q7493815\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Shelley Posen\"}}, {\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q19894382\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Duke Redbird\"}}, {\"participant\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q24933472\"}, \"participantLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Guy Sioui Durand\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer\n",
      "Final Answer: The participants in the 1974 Mariposa Folk Festival were Malvina Reynolds, John Hammond, Steve Goodman, Bill Reid, Alanis Obomsawin, Willie Dunn, Gilles Losier, Joe Hickerson, Robert Davidson, Shelley Posen, Duke Redbird, and Guy Sioui Durand.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The participants in the 1974 Mariposa Folk Festival were Malvina Reynolds, John Hammond, Steve Goodman, Bill Reid, Alanis Obomsawin, Willie Dunn, Gilles Losier, Joe Hickerson, Robert Davidson, Shelley Posen, Duke Redbird, and Guy Sioui Durand.'"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"Who participated in the 1974 Mariposa Folk Festival?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "fdfeab58-bd21-4ffc-a550-44fbcc854b4e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the q-item for \"Zakhar Oskotsky.\"\n",
      "Action: ItemLookup\n",
      "Action Input: Zakhar Oskotsky\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ4338004\u001b[0m\u001b[32;1m\u001b[1;3mI need to find the p-item for \"place of birth.\"\n",
      "Action: PropertyLookup\n",
      "Action Input: place of birth\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP19\u001b[0m\u001b[32;1m\u001b[1;3mI need to write a sparql query to find the city where Zakhar Oskotsky was born.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?city ?cityLabel WHERE {\n",
      "  wd:Q4338004 wdt:P19 ?city .\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
      "}\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"city\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q656\"}, \"cityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Saint Petersburg\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI need to find the p-item for \"sister city.\"\n",
      "Action: PropertyLookup\n",
      "Action Input: sister city\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP190\u001b[0m\u001b[32;1m\u001b[1;3mI need to write a sparql query to find the sister cities of Saint Petersburg.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?sisterCity ?sisterCityLabel WHERE {\n",
      "  wd:Q656 wdt:P190 ?sisterCity .\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
      "  } LIMIT 10\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q117040\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Santiago de Cuba\"}}, {\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q158876\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Reinickendorf\"}}, {\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q170322\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Qingdao\"}}, {\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q180522\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Aqaba\"}}, {\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q180717\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Sousse\"}}, {\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q185632\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Limassol\"}}, {\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q189546\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Bizerte\"}}, {\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q190583\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Mikkeli\"}}, {\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q192155\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Kotka\"}}, {\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q192225\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Netanya\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer.\n",
      "Final Answer: Zakhar Oskotsky was born in Saint Petersburg. Some sister cities of Saint Petersburg are Santiago de Cuba, Reinickendorf, Qingdao, Aqaba, Sousse, Limassol, Bizerte, Mikkeli, Kotka, and Netanya.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Zakhar Oskotsky was born in Saint Petersburg. Some sister cities of Saint Petersburg are Santiago de Cuba, Reinickendorf, Qingdao, Aqaba, Sousse, Limassol, Bizerte, Mikkeli, Kotka, and Netanya.'"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"In what city was Zakhar Oskotsky born? Please also list at most 10 sister cities of that city?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "1f1ab573-6da5-407a-b5d3-8f0cfb9d77ad",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: First, I need to find the Q item for St. Petersburg.\n",
      "Action: ItemLookup\n",
      "Action Input: St. Petersburg\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ49236\u001b[0m\u001b[32;1m\u001b[1;3mNow, I need to find the P item for sister city relationships.\n",
      "Action: PropertyLookup\n",
      "Action Input: sister city\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP190\u001b[0m\u001b[32;1m\u001b[1;3mNow, I can create a query to get the sister cities of St. Petersburg and their distances from it.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?sisterCity ?sisterCityLabel ?distance WHERE {\n",
      "  wd:Q49236 wdt:P190 ?sisterCity .\n",
      "  wd:Q49236 wdt:P625 ?coordinates1 .\n",
      "  ?sisterCity wdt:P625 ?coordinates2 .\n",
      "  BIND(geof:distance(?coordinates1, ?coordinates2) AS ?distance) .\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
      "}\n",
      "ORDER BY DESC(?distance)\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q200707\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Takamatsu\"}, \"distance\": {\"datatype\": \"http://www.w3.org/2001/XMLSchema#double\", \"type\": \"literal\", \"value\": \"12102.183328028144\"}}, {\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q656\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Saint Petersburg\"}, \"distance\": {\"datatype\": \"http://www.w3.org/2001/XMLSchema#double\", \"type\": \"literal\", \"value\": \"8525.117986961084\"}}, {\"sisterCity\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q6839\"}, \"sisterCityLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Figueres\"}, \"distance\": {\"datatype\": \"http://www.w3.org/2001/XMLSchema#double\", \"type\": \"literal\", \"value\": \"7635.306942481415\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer.\n",
      "Final Answer: The sister city of St. Petersburg that is furthest from it is Takamatsu, with a distance of 12,102.18 km.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The sister city of St. Petersburg that is furthest from it is Takamatsu, with a distance of 12,102.18 km.'"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "agent_executor.run(\"Which sister city of St. Petersburg is furthest from it?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "9910bd21-b3ea-4bef-bf5f-8c367a1fa437",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the q-number for St. Petersburg, Russia.\n",
      "Action: ItemLookup\n",
      "Action Input: St. Petersburg, Russia\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ17056717\u001b[0m\u001b[32;1m\u001b[1;3mI need to find the p-number for 'sister city'.\n",
      "Action: PropertyLookup\n",
      "Action Input: sister city\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP190\u001b[0m\u001b[32;1m\u001b[1;3mI need to find the sister cities of St. Petersburg, Russia (Q17056717) and their distances from it.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?sisterCity ?sisterCityLabel ?distance WHERE {\n",
      "  wd:Q17056717 wdt:P190 ?sisterCity .\n",
      "  OPTIONAL {\n",
      "    wdt:Q17056717 wdt:P625 ?stPetersburgCoord .\n",
      "    ?sisterCity wdt:P625 ?sisterCityCoord .\n",
      "    BIND(geof:distance(?stPetersburgCoord, ?sisterCityCoord) as ?distance)\n",
      "  }\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
      "} ORDER BY DESC(?distance) LIMIT 1\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[]\u001b[0m"
     ]
    },
    {
     "ename": "ValueError",
     "evalue": "Could not parse LLM output: `The query didn't return any results. It is not possible to answer the question with the available data.`",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[62], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m \u001b[43magent_executor\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mWhich sister city of St. Petersburg, Russia is furthest from it?\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/chains/base.py:213\u001b[0m, in \u001b[0;36mChain.run\u001b[0;34m(self, *args, **kwargs)\u001b[0m\n\u001b[1;32m    211\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mlen\u001b[39m(args) \u001b[38;5;241m!=\u001b[39m \u001b[38;5;241m1\u001b[39m:\n\u001b[1;32m    212\u001b[0m         \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m`run` supports only one positional argument.\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m--> 213\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43margs\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;241;43m0\u001b[39;49m\u001b[43m]\u001b[49m\u001b[43m)\u001b[49m[\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39moutput_keys[\u001b[38;5;241m0\u001b[39m]]\n\u001b[1;32m    215\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m kwargs \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m args:\n\u001b[1;32m    216\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m(kwargs)[\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39moutput_keys[\u001b[38;5;241m0\u001b[39m]]\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/chains/base.py:116\u001b[0m, in \u001b[0;36mChain.__call__\u001b[0;34m(self, inputs, return_only_outputs)\u001b[0m\n\u001b[1;32m    114\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (\u001b[38;5;167;01mKeyboardInterrupt\u001b[39;00m, \u001b[38;5;167;01mException\u001b[39;00m) \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m    115\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_error(e, verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose)\n\u001b[0;32m--> 116\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m e\n\u001b[1;32m    117\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_end(outputs, verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose)\n\u001b[1;32m    118\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprep_outputs(inputs, outputs, return_only_outputs)\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/chains/base.py:113\u001b[0m, in \u001b[0;36mChain.__call__\u001b[0;34m(self, inputs, return_only_outputs)\u001b[0m\n\u001b[1;32m    107\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_start(\n\u001b[1;32m    108\u001b[0m     {\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mname\u001b[39m\u001b[38;5;124m\"\u001b[39m: \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m\u001b[38;5;18m__class__\u001b[39m\u001b[38;5;241m.\u001b[39m\u001b[38;5;18m__name__\u001b[39m},\n\u001b[1;32m    109\u001b[0m     inputs,\n\u001b[1;32m    110\u001b[0m     verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose,\n\u001b[1;32m    111\u001b[0m )\n\u001b[1;32m    112\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 113\u001b[0m     outputs \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_call\u001b[49m\u001b[43m(\u001b[49m\u001b[43minputs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    114\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (\u001b[38;5;167;01mKeyboardInterrupt\u001b[39;00m, \u001b[38;5;167;01mException\u001b[39;00m) \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m    115\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_error(e, verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose)\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/agents/agent.py:637\u001b[0m, in \u001b[0;36mAgentExecutor._call\u001b[0;34m(self, inputs)\u001b[0m\n\u001b[1;32m    635\u001b[0m \u001b[38;5;66;03m# We now enter the agent loop (until it returns something).\u001b[39;00m\n\u001b[1;32m    636\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_should_continue(iterations):\n\u001b[0;32m--> 637\u001b[0m     next_step_output \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_take_next_step\u001b[49m\u001b[43m(\u001b[49m\n\u001b[1;32m    638\u001b[0m \u001b[43m        \u001b[49m\u001b[43mname_to_tool_map\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mcolor_mapping\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43minputs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mintermediate_steps\u001b[49m\n\u001b[1;32m    639\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    640\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(next_step_output, AgentFinish):\n\u001b[1;32m    641\u001b[0m         \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_return(next_step_output, intermediate_steps)\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/agents/agent.py:553\u001b[0m, in \u001b[0;36mAgentExecutor._take_next_step\u001b[0;34m(self, name_to_tool_map, color_mapping, inputs, intermediate_steps)\u001b[0m\n\u001b[1;32m    548\u001b[0m \u001b[38;5;124;03m\"\"\"Take a single step in the thought-action-observation loop.\u001b[39;00m\n\u001b[1;32m    549\u001b[0m \n\u001b[1;32m    550\u001b[0m \u001b[38;5;124;03mOverride this to take control of how the agent makes and acts on choices.\u001b[39;00m\n\u001b[1;32m    551\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    552\u001b[0m \u001b[38;5;66;03m# Call the LLM to see what to do.\u001b[39;00m\n\u001b[0;32m--> 553\u001b[0m output \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43magent\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mplan\u001b[49m\u001b[43m(\u001b[49m\u001b[43mintermediate_steps\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43minputs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    554\u001b[0m \u001b[38;5;66;03m# If the tool chosen is the finishing tool, then we end and return.\u001b[39;00m\n\u001b[1;32m    555\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(output, AgentFinish):\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/agents/agent.py:176\u001b[0m, in \u001b[0;36mLLMSingleActionAgent.plan\u001b[0;34m(self, intermediate_steps, **kwargs)\u001b[0m\n\u001b[1;32m    163\u001b[0m \u001b[38;5;124;03m\"\"\"Given input, decided what to do.\u001b[39;00m\n\u001b[1;32m    164\u001b[0m \n\u001b[1;32m    165\u001b[0m \u001b[38;5;124;03mArgs:\u001b[39;00m\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    171\u001b[0m \u001b[38;5;124;03m    Action specifying what tool to use.\u001b[39;00m\n\u001b[1;32m    172\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    173\u001b[0m output \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mllm_chain\u001b[38;5;241m.\u001b[39mrun(\n\u001b[1;32m    174\u001b[0m     intermediate_steps\u001b[38;5;241m=\u001b[39mintermediate_steps, stop\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mstop, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs\n\u001b[1;32m    175\u001b[0m )\n\u001b[0;32m--> 176\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43moutput_parser\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mparse\u001b[49m\u001b[43m(\u001b[49m\u001b[43moutput\u001b[49m\u001b[43m)\u001b[49m\n",
      "Cell \u001b[0;32mIn[47], line 16\u001b[0m, in \u001b[0;36mCustomOutputParser.parse\u001b[0;34m(self, llm_output)\u001b[0m\n\u001b[1;32m     14\u001b[0m match \u001b[38;5;241m=\u001b[39m re\u001b[38;5;241m.\u001b[39msearch(regex, llm_output, re\u001b[38;5;241m.\u001b[39mDOTALL)\n\u001b[1;32m     15\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m match:\n\u001b[0;32m---> 16\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mCould not parse LLM output: `\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mllm_output\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m`\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m     17\u001b[0m action \u001b[38;5;241m=\u001b[39m match\u001b[38;5;241m.\u001b[39mgroup(\u001b[38;5;241m1\u001b[39m)\u001b[38;5;241m.\u001b[39mstrip()\n\u001b[1;32m     18\u001b[0m action_input \u001b[38;5;241m=\u001b[39m match\u001b[38;5;241m.\u001b[39mgroup(\u001b[38;5;241m2\u001b[39m)\n",
      "\u001b[0;31mValueError\u001b[0m: Could not parse LLM output: `The query didn't return any results. It is not possible to answer the question with the available data.`"
     ]
    }
   ],
   "source": [
    "agent_executor.run(\"Which sister city of St. Petersburg, Russia is furthest from it?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "7f4bafa9-62a9-40dd-9bb9-8f3d4421cde8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the Q number for St. Peters Junior School\n",
      "Action: ItemLookup\n",
      "Action Input: St. Peters Junior School\n",
      "\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ66230785\u001b[0m\u001b[32;1m\u001b[1;3mNow I need to find the property for maximum age\n",
      "Action: PropertyLookup\n",
      "Action Input: maximum age\n",
      "\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP4135\u001b[0m\u001b[32;1m\u001b[1;3mNow I can create a SPARQL query to find the maximum age of St. Peters Junior School\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?maximum_age ?maximum_ageLabel WHERE {\n",
      "  wd:Q66230785 wdt:P4135 ?maximum_age .\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
      "}\n",
      "\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[]\u001b[0m"
     ]
    },
    {
     "ename": "ValueError",
     "evalue": "Could not parse LLM output: `I couldn't find the maximum age information for St. Peters Junior School in the Wikidata database.`",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[88], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m \u001b[43magent_executor\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mIs 11 the maximum age of St. Peters Junior School?\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/chains/base.py:213\u001b[0m, in \u001b[0;36mChain.run\u001b[0;34m(self, *args, **kwargs)\u001b[0m\n\u001b[1;32m    211\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mlen\u001b[39m(args) \u001b[38;5;241m!=\u001b[39m \u001b[38;5;241m1\u001b[39m:\n\u001b[1;32m    212\u001b[0m         \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m`run` supports only one positional argument.\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m--> 213\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43margs\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;241;43m0\u001b[39;49m\u001b[43m]\u001b[49m\u001b[43m)\u001b[49m[\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39moutput_keys[\u001b[38;5;241m0\u001b[39m]]\n\u001b[1;32m    215\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m kwargs \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m args:\n\u001b[1;32m    216\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m(kwargs)[\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39moutput_keys[\u001b[38;5;241m0\u001b[39m]]\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/chains/base.py:116\u001b[0m, in \u001b[0;36mChain.__call__\u001b[0;34m(self, inputs, return_only_outputs)\u001b[0m\n\u001b[1;32m    114\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (\u001b[38;5;167;01mKeyboardInterrupt\u001b[39;00m, \u001b[38;5;167;01mException\u001b[39;00m) \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m    115\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_error(e, verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose)\n\u001b[0;32m--> 116\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m e\n\u001b[1;32m    117\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_end(outputs, verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose)\n\u001b[1;32m    118\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprep_outputs(inputs, outputs, return_only_outputs)\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/chains/base.py:113\u001b[0m, in \u001b[0;36mChain.__call__\u001b[0;34m(self, inputs, return_only_outputs)\u001b[0m\n\u001b[1;32m    107\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_start(\n\u001b[1;32m    108\u001b[0m     {\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mname\u001b[39m\u001b[38;5;124m\"\u001b[39m: \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m\u001b[38;5;18m__class__\u001b[39m\u001b[38;5;241m.\u001b[39m\u001b[38;5;18m__name__\u001b[39m},\n\u001b[1;32m    109\u001b[0m     inputs,\n\u001b[1;32m    110\u001b[0m     verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose,\n\u001b[1;32m    111\u001b[0m )\n\u001b[1;32m    112\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 113\u001b[0m     outputs \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_call\u001b[49m\u001b[43m(\u001b[49m\u001b[43minputs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    114\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (\u001b[38;5;167;01mKeyboardInterrupt\u001b[39;00m, \u001b[38;5;167;01mException\u001b[39;00m) \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m    115\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_error(e, verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose)\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/agents/agent.py:637\u001b[0m, in \u001b[0;36mAgentExecutor._call\u001b[0;34m(self, inputs)\u001b[0m\n\u001b[1;32m    635\u001b[0m \u001b[38;5;66;03m# We now enter the agent loop (until it returns something).\u001b[39;00m\n\u001b[1;32m    636\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_should_continue(iterations):\n\u001b[0;32m--> 637\u001b[0m     next_step_output \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_take_next_step\u001b[49m\u001b[43m(\u001b[49m\n\u001b[1;32m    638\u001b[0m \u001b[43m        \u001b[49m\u001b[43mname_to_tool_map\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mcolor_mapping\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43minputs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mintermediate_steps\u001b[49m\n\u001b[1;32m    639\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    640\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(next_step_output, AgentFinish):\n\u001b[1;32m    641\u001b[0m         \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_return(next_step_output, intermediate_steps)\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/agents/agent.py:553\u001b[0m, in \u001b[0;36mAgentExecutor._take_next_step\u001b[0;34m(self, name_to_tool_map, color_mapping, inputs, intermediate_steps)\u001b[0m\n\u001b[1;32m    548\u001b[0m \u001b[38;5;124;03m\"\"\"Take a single step in the thought-action-observation loop.\u001b[39;00m\n\u001b[1;32m    549\u001b[0m \n\u001b[1;32m    550\u001b[0m \u001b[38;5;124;03mOverride this to take control of how the agent makes and acts on choices.\u001b[39;00m\n\u001b[1;32m    551\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    552\u001b[0m \u001b[38;5;66;03m# Call the LLM to see what to do.\u001b[39;00m\n\u001b[0;32m--> 553\u001b[0m output \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43magent\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mplan\u001b[49m\u001b[43m(\u001b[49m\u001b[43mintermediate_steps\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43minputs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    554\u001b[0m \u001b[38;5;66;03m# If the tool chosen is the finishing tool, then we end and return.\u001b[39;00m\n\u001b[1;32m    555\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(output, AgentFinish):\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/agents/agent.py:176\u001b[0m, in \u001b[0;36mLLMSingleActionAgent.plan\u001b[0;34m(self, intermediate_steps, **kwargs)\u001b[0m\n\u001b[1;32m    163\u001b[0m \u001b[38;5;124;03m\"\"\"Given input, decided what to do.\u001b[39;00m\n\u001b[1;32m    164\u001b[0m \n\u001b[1;32m    165\u001b[0m \u001b[38;5;124;03mArgs:\u001b[39;00m\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    171\u001b[0m \u001b[38;5;124;03m    Action specifying what tool to use.\u001b[39;00m\n\u001b[1;32m    172\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    173\u001b[0m output \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mllm_chain\u001b[38;5;241m.\u001b[39mrun(\n\u001b[1;32m    174\u001b[0m     intermediate_steps\u001b[38;5;241m=\u001b[39mintermediate_steps, stop\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mstop, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs\n\u001b[1;32m    175\u001b[0m )\n\u001b[0;32m--> 176\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43moutput_parser\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mparse\u001b[49m\u001b[43m(\u001b[49m\u001b[43moutput\u001b[49m\u001b[43m)\u001b[49m\n",
      "Cell \u001b[0;32mIn[79], line 16\u001b[0m, in \u001b[0;36mCustomOutputParser.parse\u001b[0;34m(self, llm_output)\u001b[0m\n\u001b[1;32m     14\u001b[0m match \u001b[38;5;241m=\u001b[39m re\u001b[38;5;241m.\u001b[39msearch(regex, llm_output, re\u001b[38;5;241m.\u001b[39mDOTALL)\n\u001b[1;32m     15\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m match:\n\u001b[0;32m---> 16\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mCould not parse LLM output: `\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mllm_output\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m`\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m     17\u001b[0m action \u001b[38;5;241m=\u001b[39m match\u001b[38;5;241m.\u001b[39mgroup(\u001b[38;5;241m1\u001b[39m)\u001b[38;5;241m.\u001b[39mstrip()\n\u001b[1;32m     18\u001b[0m action_input \u001b[38;5;241m=\u001b[39m match\u001b[38;5;241m.\u001b[39mgroup(\u001b[38;5;241m2\u001b[39m)\n",
      "\u001b[0;31mValueError\u001b[0m: Could not parse LLM output: `I couldn't find the maximum age information for St. Peters Junior School in the Wikidata database.`"
     ]
    }
   ],
   "source": [
    "agent_executor.run(\"Is 11 the maximum age of St. Peters Junior School?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "4da543ff-7ff1-4bd3-8a05-6a37c4e8d259",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: To answer this question, I need to find the naval artillery with the smallest firing range. I need to know the q number for naval artillery and the p number for firing range before I can create a sparql query.\n",
      "Action: PropertyLookup\n",
      "Action Input: firing range\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP4176\u001b[0m\u001b[32;1m\u001b[1;3mNow I know the p-number for firing range (P4176). Next, I need to find the q-number for naval artillery.\n",
      "Action: ItemLookup\n",
      "Action Input: naval artillery\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ511450\u001b[0m\u001b[32;1m\u001b[1;3mNow I have both the p-number for firing range (P4176) and the q-number for naval artillery (Q511450). I can now create a sparql query to find the naval artillery with the smallest firing range.\n",
      "\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT ?artillery ?artilleryLabel ?range\n",
      "WHERE \n",
      "{\n",
      "  ?artillery wdt:P31 wd:Q511450 .\n",
      "  ?artillery wdt:P4176 ?range .\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
      "}\n",
      "ORDER BY ?range\n",
      "LIMIT 1\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer\n",
      "Final Answer: The Wikidata doesn't have any data for naval artillery with a firing range.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "def r(s):\n",
    "    agent_executor.run(s)\n",
    "r(\"Name the naval artillery wirh the smallest firing range?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "292606d2-19e4-4f1f-bc27-2c3fffb8bbc0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to know the q-number for \"commune of France\" to search for them\n",
      "Action: ItemLookup\n",
      "Action Input: commune of France\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ484170\u001b[0m\u001b[32;1m\u001b[1;3mI need to know the p-number for \"population\" to find the commune with the lowest population\n",
      "Action: PropertyLookup\n",
      "Action Input: population\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP1082\u001b[0m\u001b[32;1m\u001b[1;3mI can now generate a sparql query to find the commune of France with the lowest population\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
      "PREFIX p: <http://www.wikidata.org/prop/>\n",
      "PREFIX ps: <http://www.wikidata.org/prop/statement/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "\n",
      "SELECT ?commune ?communeLabel ?population\n",
      "WHERE {\n",
      "  ?commune wdt:P31 wd:Q484170.\n",
      "  ?commune wdt:P1082 ?population.\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
      "}\n",
      "ORDER BY ?population\n",
      "LIMIT 1\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"commune\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q59254\"}, \"population\": {\"datatype\": \"http://www.w3.org/2001/XMLSchema#decimal\", \"type\": \"literal\", \"value\": \"0\"}, \"communeLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Fleury-devant-Douaumont\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer\n",
      "Final Answer: The commune of France with the lowest population is Fleury-devant-Douaumont with a population of 0.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "r(\"What is the commune of France with the lowest population?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "da88ce6c-2894-4718-a312-d36efe7db656",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the p and q items for \"commune of France\" and \"population\".\n",
      "Action: PropertyLookup\n",
      "Action Input: commune of France\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP8422\u001b[0m\u001b[32;1m\u001b[1;3mI found the property for \"commune of France\". Now I need to find the property for \"population\".\n",
      "Action: PropertyLookup\n",
      "Action Input: population\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP1082\u001b[0m\u001b[32;1m\u001b[1;3mI found the property for \"population\". Now I can generate the sparql to find the commune of France with the lowest population.\n",
      "Final Answer: SELECT ?commune ?communeLabel ?population WHERE {\n",
      "  ?commune wdt:P8422 [].  # Commune of France\n",
      "  ?commune wdt:P1082 ?population. # Population\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
      "} ORDER BY ?population LIMIT 1\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "r(\"Please generate sparql to answer this question: What is the commune of France with the lowest population?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "b0bd8093-a430-4629-a573-2277bebf0a77",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: To answer this question, I need to find communes in France with a population of zero. I first need to find the Q-item for France and the P-item for both population and administrative territorial entity.\n",
      "Action: ItemLookup\n",
      "Action Input: France\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ23072410\u001b[0m\u001b[32;1m\u001b[1;3mI found the Q-item for France (Q23072410). Now I need to find the P-items for population and administrative territorial entity.\n",
      "Action: PropertyLookup\n",
      "Action Input: population\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP1082\u001b[0m\u001b[32;1m\u001b[1;3mI found the P-item for population (P1082). Now, I need to find the P-item for administrative territorial entity.\n",
      "Action: PropertyLookup\n",
      "Action Input: administrative territorial entity\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP131\u001b[0m\u001b[32;1m\u001b[1;3mI found the P-item for administrative territorial entity (P131). Now, I can create a SPARQL query to find communes in France with a population of zero.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
      "PREFIX p: <http://www.wikidata.org/prop/>\n",
      "PREFIX ps: <http://www.wikidata.org/prop/statement/>\n",
      "\n",
      "SELECT ?commune ?communeLabel WHERE {\n",
      "  ?commune wdt:P1082 0;\n",
      "           wdt:P131+ wd:Q23072410.\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
      "}\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer\n",
      "Final Answer: There are no communes in France with a population of zero.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "r(\"What communes of France have population zero?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "4e5555a4-5ec0-4316-8acb-6f07839c5e70",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the q-number for Korea and the p-number for \"origination\" or \"country of origin.\" Then, I can query for sauces that originated in Korea.\n",
      "Action: PropertyLookup\n",
      "Action Input: country of origin\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP495\u001b[0m\u001b[32;1m\u001b[1;3mI found the p-number for \"country of origin.\" Now, I need to find the q-number for Korea.\n",
      "Action: ItemLookup\n",
      "Action Input: Korea\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ19986697\u001b[0m\u001b[32;1m\u001b[1;3mI found the q-number for Korea. Now, I can create a SPARQL query to find sauces that originated in Korea.\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "SELECT DISTINCT ?sauce ?sauceLabel WHERE {\n",
      "  ?sauce wdt:P279* wd:Q6271973 . # Sauces\n",
      "  ?sauce wdt:P495 wd:Q19986697 .  # Country of origin: Korea\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n",
      "}\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[]\u001b[0m"
     ]
    },
    {
     "ename": "ValueError",
     "evalue": "Could not parse LLM output: `I found no results for sauces that originated in Korea. It's possible that the data is missing or incomplete in Wikidata, or the phrasing of my query is too restrictive.`",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[93], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m \u001b[43mr\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mWhich is the sauce that originated in Korea?\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\n",
      "Cell \u001b[0;32mIn[89], line 2\u001b[0m, in \u001b[0;36mr\u001b[0;34m(s)\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mr\u001b[39m(s):\n\u001b[0;32m----> 2\u001b[0m     \u001b[43magent_executor\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43ms\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/chains/base.py:213\u001b[0m, in \u001b[0;36mChain.run\u001b[0;34m(self, *args, **kwargs)\u001b[0m\n\u001b[1;32m    211\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mlen\u001b[39m(args) \u001b[38;5;241m!=\u001b[39m \u001b[38;5;241m1\u001b[39m:\n\u001b[1;32m    212\u001b[0m         \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m`run` supports only one positional argument.\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m--> 213\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43margs\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;241;43m0\u001b[39;49m\u001b[43m]\u001b[49m\u001b[43m)\u001b[49m[\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39moutput_keys[\u001b[38;5;241m0\u001b[39m]]\n\u001b[1;32m    215\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m kwargs \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m args:\n\u001b[1;32m    216\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m(kwargs)[\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39moutput_keys[\u001b[38;5;241m0\u001b[39m]]\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/chains/base.py:116\u001b[0m, in \u001b[0;36mChain.__call__\u001b[0;34m(self, inputs, return_only_outputs)\u001b[0m\n\u001b[1;32m    114\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (\u001b[38;5;167;01mKeyboardInterrupt\u001b[39;00m, \u001b[38;5;167;01mException\u001b[39;00m) \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m    115\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_error(e, verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose)\n\u001b[0;32m--> 116\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m e\n\u001b[1;32m    117\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_end(outputs, verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose)\n\u001b[1;32m    118\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprep_outputs(inputs, outputs, return_only_outputs)\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/chains/base.py:113\u001b[0m, in \u001b[0;36mChain.__call__\u001b[0;34m(self, inputs, return_only_outputs)\u001b[0m\n\u001b[1;32m    107\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_start(\n\u001b[1;32m    108\u001b[0m     {\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mname\u001b[39m\u001b[38;5;124m\"\u001b[39m: \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m\u001b[38;5;18m__class__\u001b[39m\u001b[38;5;241m.\u001b[39m\u001b[38;5;18m__name__\u001b[39m},\n\u001b[1;32m    109\u001b[0m     inputs,\n\u001b[1;32m    110\u001b[0m     verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose,\n\u001b[1;32m    111\u001b[0m )\n\u001b[1;32m    112\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 113\u001b[0m     outputs \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_call\u001b[49m\u001b[43m(\u001b[49m\u001b[43minputs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    114\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (\u001b[38;5;167;01mKeyboardInterrupt\u001b[39;00m, \u001b[38;5;167;01mException\u001b[39;00m) \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m    115\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcallback_manager\u001b[38;5;241m.\u001b[39mon_chain_error(e, verbose\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mverbose)\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/agents/agent.py:637\u001b[0m, in \u001b[0;36mAgentExecutor._call\u001b[0;34m(self, inputs)\u001b[0m\n\u001b[1;32m    635\u001b[0m \u001b[38;5;66;03m# We now enter the agent loop (until it returns something).\u001b[39;00m\n\u001b[1;32m    636\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_should_continue(iterations):\n\u001b[0;32m--> 637\u001b[0m     next_step_output \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_take_next_step\u001b[49m\u001b[43m(\u001b[49m\n\u001b[1;32m    638\u001b[0m \u001b[43m        \u001b[49m\u001b[43mname_to_tool_map\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mcolor_mapping\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43minputs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mintermediate_steps\u001b[49m\n\u001b[1;32m    639\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    640\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(next_step_output, AgentFinish):\n\u001b[1;32m    641\u001b[0m         \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_return(next_step_output, intermediate_steps)\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/agents/agent.py:553\u001b[0m, in \u001b[0;36mAgentExecutor._take_next_step\u001b[0;34m(self, name_to_tool_map, color_mapping, inputs, intermediate_steps)\u001b[0m\n\u001b[1;32m    548\u001b[0m \u001b[38;5;124;03m\"\"\"Take a single step in the thought-action-observation loop.\u001b[39;00m\n\u001b[1;32m    549\u001b[0m \n\u001b[1;32m    550\u001b[0m \u001b[38;5;124;03mOverride this to take control of how the agent makes and acts on choices.\u001b[39;00m\n\u001b[1;32m    551\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    552\u001b[0m \u001b[38;5;66;03m# Call the LLM to see what to do.\u001b[39;00m\n\u001b[0;32m--> 553\u001b[0m output \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43magent\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mplan\u001b[49m\u001b[43m(\u001b[49m\u001b[43mintermediate_steps\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43minputs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    554\u001b[0m \u001b[38;5;66;03m# If the tool chosen is the finishing tool, then we end and return.\u001b[39;00m\n\u001b[1;32m    555\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(output, AgentFinish):\n",
      "File \u001b[0;32m/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/agents/agent.py:176\u001b[0m, in \u001b[0;36mLLMSingleActionAgent.plan\u001b[0;34m(self, intermediate_steps, **kwargs)\u001b[0m\n\u001b[1;32m    163\u001b[0m \u001b[38;5;124;03m\"\"\"Given input, decided what to do.\u001b[39;00m\n\u001b[1;32m    164\u001b[0m \n\u001b[1;32m    165\u001b[0m \u001b[38;5;124;03mArgs:\u001b[39;00m\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    171\u001b[0m \u001b[38;5;124;03m    Action specifying what tool to use.\u001b[39;00m\n\u001b[1;32m    172\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    173\u001b[0m output \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mllm_chain\u001b[38;5;241m.\u001b[39mrun(\n\u001b[1;32m    174\u001b[0m     intermediate_steps\u001b[38;5;241m=\u001b[39mintermediate_steps, stop\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mstop, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs\n\u001b[1;32m    175\u001b[0m )\n\u001b[0;32m--> 176\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43moutput_parser\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mparse\u001b[49m\u001b[43m(\u001b[49m\u001b[43moutput\u001b[49m\u001b[43m)\u001b[49m\n",
      "Cell \u001b[0;32mIn[79], line 16\u001b[0m, in \u001b[0;36mCustomOutputParser.parse\u001b[0;34m(self, llm_output)\u001b[0m\n\u001b[1;32m     14\u001b[0m match \u001b[38;5;241m=\u001b[39m re\u001b[38;5;241m.\u001b[39msearch(regex, llm_output, re\u001b[38;5;241m.\u001b[39mDOTALL)\n\u001b[1;32m     15\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m match:\n\u001b[0;32m---> 16\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mCould not parse LLM output: `\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mllm_output\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m`\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m     17\u001b[0m action \u001b[38;5;241m=\u001b[39m match\u001b[38;5;241m.\u001b[39mgroup(\u001b[38;5;241m1\u001b[39m)\u001b[38;5;241m.\u001b[39mstrip()\n\u001b[1;32m     18\u001b[0m action_input \u001b[38;5;241m=\u001b[39m match\u001b[38;5;241m.\u001b[39mgroup(\u001b[38;5;241m2\u001b[39m)\n",
      "\u001b[0;31mValueError\u001b[0m: Could not parse LLM output: `I found no results for sauces that originated in Korea. It's possible that the data is missing or incomplete in Wikidata, or the phrasing of my query is too restrictive.`"
     ]
    }
   ],
   "source": [
    "r(\"Which is the sauce that originated in Korea?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "id": "2c1c68b5-06e1-4340-bc41-82a09d6850d5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the q-number for Christopher Hitchens\n",
      "Action: ItemLookup\n",
      "Action Input: Christopher Hitchens\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ49081\u001b[0m\u001b[32;1m\u001b[1;3mI need to find the p-number for notable work\n",
      "Action: PropertyLookup\n",
      "Action Input: notable work\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP800\u001b[0m\u001b[32;1m\u001b[1;3mI can now construct a sparql to get notable works by Christopher Hitchens\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "\n",
      "SELECT ?work ?workLabel\n",
      "WHERE {\n",
      "  wd:Q49081 wdt:P800 ?work.\n",
      "  ?work rdfs:label ?workLabel.\n",
      "  FILTER (LANG(?workLabel) = \"en\")\n",
      "}\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q24596\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"God Is Not Great\"}}, {\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q2699045\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"The Missionary Position: Mother Teresa in Theory and Practice\"}}, {\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q3138625\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Hitch-22\"}}, {\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q3237057\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Letters to a Young Contrarian\"}}, {\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q6914395\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Mortality\"}}, {\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q7044696\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"No One Left to Lie To\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer\n",
      "Final Answer: Some notable works by Christopher Hitchens include \"God Is Not Great,\" \"The Missionary Position: Mother Teresa in Theory and Practice,\" \"Hitch-22,\" \"Letters to a Young Contrarian,\" \"Mortality,\" and \"No One Left to Lie To.\"\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "r(\"What are some notable work by Christopher Hitchens?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "id": "49d86400-1940-4255-aa4b-77b903583f75",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThought: I need to find the QID for Christopher Hitchens\n",
      "Action: ItemLookup\n",
      "Action Input: Christopher Hitchens\u001b[0m\n",
      "\n",
      "Observation:\u001b[36;1m\u001b[1;3mQ49081\u001b[0m\u001b[32;1m\u001b[1;3mI need to find the PID for notable work and publisher\n",
      "Action: PropertyLookup\n",
      "Action Input: notable work\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP800\u001b[0m\u001b[32;1m\u001b[1;3mI also need to find the PID for publisher\n",
      "Action: PropertyLookup\n",
      "Action Input: publisher\u001b[0m\n",
      "\n",
      "Observation:\u001b[33;1m\u001b[1;3mP123\u001b[0m\u001b[32;1m\u001b[1;3mI have the QID for Christopher Hitchens and the PIDs for notable work and publisher, so I can write a SPARQL query now\n",
      "Action: SparqlQueryRunner\n",
      "Action Input: \n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "\n",
      "SELECT ?work ?workLabel ?publisher ?publisherLabel WHERE {\n",
      "  wd:Q49081 wdt:P800 ?work .\n",
      "  ?work wdt:P123 ?publisher .\n",
      "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
      "} LIMIT 10\u001b[0m\n",
      "\n",
      "Observation:\u001b[38;5;200m\u001b[1;3m[{\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q24596\"}, \"publisher\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q1567078\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"God Is Not Great\"}, \"publisherLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Hachette Book Group\"}}, {\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q2699045\"}, \"publisher\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q4010248\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"The Missionary Position: Mother Teresa in Theory and Practice\"}, \"publisherLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Verso Books\"}}, {\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q3138625\"}, \"publisher\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q1567078\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Hitch-22\"}, \"publisherLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Hachette Book Group\"}}, {\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q3138625\"}, \"publisher\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q4816305\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Hitch-22\"}, \"publisherLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Atlantic Books\"}}, {\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q6914395\"}, \"publisher\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q1567078\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Mortality\"}, \"publisherLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Hachette Book Group\"}}, {\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q6914395\"}, \"publisher\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q4816305\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Mortality\"}, \"publisherLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Atlantic Books\"}}, {\"work\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q7044696\"}, \"publisher\": {\"type\": \"uri\", \"value\": \"http://www.wikidata.org/entity/Q4010248\"}, \"workLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"No One Left to Lie To\"}, \"publisherLabel\": {\"xml:lang\": \"en\", \"type\": \"literal\", \"value\": \"Verso Books\"}}]\u001b[0m\u001b[32;1m\u001b[1;3mI now know the final answer\n",
      "Final Answer: Some notable works by Christopher Hitchens and their publishers are:\n",
      "1. \"God Is Not Great\" published by Hachette Book Group.\n",
      "2. \"The Missionary Position: Mother Teresa in Theory and Practice\" published by Verso Books.\n",
      "3. \"Hitch-22\" published by Hachette Book Group and Atlantic Books.\n",
      "4. \"Mortality\" published by Hachette Book Group and Atlantic Books.\n",
      "5. \"No One Left to Lie To\" published by Verso Books.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "r(\"What are some notable work by Christopher Hitchens and what are their publishers?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "94965b33-5960-4852-a7be-5fbdae4c25fd",
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'r' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[1], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m \u001b[43mr\u001b[49m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mWhat are the three variants of hepatitis?\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n",
      "\u001b[0;31mNameError\u001b[0m: name 'r' is not defined"
     ]
    }
   ],
   "source": [
    "r(\"What are the three variants of hepatitis?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "92295ae2-a79c-42c6-883c-b9500638f025",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "conda210",
   "language": "python",
   "name": "conda210"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
